tutorials/openfoam_tutorials/incompressible/les/NACA4412/constant/turbulenceProperties
FoamFile
{
    format          ascii;
    class           dictionary;
    location        "constant";
    object          turbulenceProperties;
}

simulationType  LES;

LES
{
    LESModel        kEqn;

    turbulence      on;
    printCoeffs     on;

    delta           cubeRootVol;

    cubeRootVolCoeffs
    {
        deltaCoeff      1;
    }

    kEqnCoeffs
    {
        Ck              0.094;
        Ce              1.048;
    }
}