tutorials/openfoam_tutorials/incompressible/les/NACA4412/system/volFields
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

CourantNo
{
    type            CourantNo;
    libs            (fieldFunctionObjects);

    enabled         true;
    writeControl    writeTime;
}

vorticity
{
    type            vorticity;
    libs            (fieldFunctionObjects);

    enabled         true;
    writeControl    writeTime;
}

Q
{
    type            Q;
    libs            (fieldFunctionObjects);

    enabled         true;
    writeControl    writeTime;
}

DESModelRegions
{
    type            DESModelRegions;
    libs            (fieldFunctionObjects);

    enabled         true;
    writeControl    writeTime;
    result          DESField;
}

blendingFactor
{
    type            blendingFactor;
    libs            (fieldFunctionObjects);

    field           U;

    enabled         true;
    writeControl    writeTime;
    log             false;
}

turbulenceFields
{
    type            turbulenceFields;
    libs            (fieldFunctionObjects);
    field           fd;

    enabled         true;
    writeControl    writeTime;
}

// ************************************************************************* //
